[
  {
    "category_name": "Top 100 Lines",
    "category_id": "top100",
    "icon": "🏆",
    "messages": [
      "I hope you know CPR, because you just took my breath away!",
      "Your eyes are like the ocean; I could swim in them all day.",
      "I never believed in love at first sight, but that was before I saw you.",
      "They say Disney World is the happiest place on Earth, but clearly they've never stood next to you.",
      "I must be in a museum because you're a piece of art.",
      "If beauty were time, you'd be eternity.",
      "I swear someone stole the stars from the sky and put them in your eyes.",
      "Wow, when God made you, he was seriously showing off.",
      "Well, here I am! What are your other two wishes?",
      "I can't help but smile whenever I think about you.",
      "Your smile is the best part of my day.",
      "You make everything better just by being around.",
      "You're the reason I look forward to tomorrow.",
      "Every love song makes me think of you.",
      "Now that I've seen you, life without you is like a broken pencil…pointless.",
      "Your smile is proof that the best things in life are free.",
      "If you were a vegetable, you'd be a cute-cumber.",
      "If you were a fruit, you'd be a fine-apple.",
      "My love for you is like Pi... never-ending.",
      "Even if there was no gravity on Earth, I'd still fall for you.",
      "You must be made of uranium and iodine, because all I can see is U and I together.",
      "You're like a hidden lyric in my favorite song—something I didn't know I needed until I found it.",
      "I wasn't planning to fall for someone today, but here you are.",
      "You're like an unsaved Word doc—I'd panic if I ever lost you.",
      "You're my favorite thought I rewind a thousand times before I sleep.",
      "You make me want to write love songs in languages I don't even speak.",
      "You're the 'good' in all my good mornings.",
      "You give soft places for my mind to rest.",
      "Every time you laugh, my world realigns.",
      "You're my favorite 'unexpected' ever.",
      "I'd rather have one lifetime with you than eternity without.",
      "You have the kind of warmth that makes a house a home.",
      "If I could build a home out of someone's soul—it'd be yours.",
      "You're the moment in my day I didn't know I was waiting for.",
      "If I could pause life, it would be on your laughter.",
      "You're the kind of person poems fail to describe.",
      "I'd memorize your flaws just to love you right.",
      "You're the wish my eyelashes made before I knew I needed one.",
      "You bring peace where even music fails.",
      "I'm not currently an organ donor, but I'd be happy to give you my heart.",
      "You must be a h*ll of a thief, because you managed to steal my heart from across the room.",
      "If I could rearrange the alphabet, I'd put U and I together.",
      "I'm not a photographer, but I can picture me and you together.",
      "You are the reason my heart beats faster every time I hear your name.",
      "You make every day feel like Valentine's Day.",
      "Your love is the most precious gift I've ever received.",
      "You complete me in every way possible.",
      "Being with you feels like magic.",
      "You are my one and only.",
      "You're the most beautiful chapter in my life.",
      "My heart beats for you alone.",
      "Loving you is the best decision I've ever made.",
      "Do you have a pencil? Because I want to erase your past and write our future.",
      "Let's commit the perfect crime. I'll steal your heart, you steal mine.",
      "I bought you a dictionary since you add so much meaning to my life.",
      "Cupid called. He says you need to return my heart.",
      "If I had a time machine, I'd use it to relive this exact moment.",
      "My new favorite numbers are one and four...because you're the one four me.",
      "You're that one track that's worth buying the whole album for.",
      "If kisses were snowflakes, I'd send you a blizzard.",
      "Do you have a Band-Aid? I scraped my knees falling for you.",
      "See that space between your fingers? That's for mine.",
      "My heart skipped a beat—and then it saw you and started dancing.",
      "I ought to complain to Spotify for you not being named this week's hottest single.",
      "I was wondering if you're an artist because you were so good at drawing me in.",
      "On a scale of 1 to America, how free are you tonight?",
      "If you were a Transformer, you'd be Optimus Fine.",
      "Are you any good at boxing? Because you look like a knockout.",
      "It's a good thing I have my library card, because I am totally checking you out.",
      "Hey, my name's Microsoft. Can I crash at your place tonight?",
      "Are you a broom? Because you've swept me off my feet.",
      "Are you from Tennessee? Because you're the only 10 I see.",
      "Are you a parking ticket? Cause you've got fine written all over you.",
      "Do you have a map? I think I just got lost in your eyes.",
      "Are you a beaver? Because dammm, girl.",
      "Kiss me if I'm wrong, but dinosaurs still exist, right?",
      "Is your name Netflix? Because I could watch you for hours.",
      "Do you play soccer? You look like a keeper.",
      "Have we met? You look exactly like my next partner.",
      "Titanic? That's my icebreaker. What's up?",
      "Your name must be Coca-Cola because you're soda-licious.",
      "Did it hurt when you fell from the vending machine? Cause you're lookin' like a snack.",
      "I heard you like bad boys? Well, I'm bad at everything.",
      "I'd flirt with you, but I'd rather seduce you with my awkwardness.",
      "You don't know how many times I've had to swipe left to find you.",
      "How much does a polar bear weigh? Enough to break the ice!",
      "I bet your birthday is October 10 because you're a 10/10.",
      "My friends bet me I couldn't talk to the prettiest girl in the bar. Want to use their money to buy some drinks?",
      "Are you a bank loan? Because you've got my interest.",
      "I'm pretty good at algebra...I can replace your X and you wouldn't need to figure out Y.",
      "Are you Siri? Because you autocomplete me.",
      "Are you the internet? Because I'm feeling a connection.",
      "Do you like Nintendo? Because Wii would be so good together.",
      "Your eyes are like IKEA. I could get lost in them for hours.",
      "Is your name Waldo? Because someone like you is hard to find.",
      "Are you a keyboard? Because you're just my type.",
      "We're not socks, but I think we'd make a great pair.",
      "Hey, you're pretty and I'm cute. Together we'd be pretty cute.",
      "You're hotter than a Bunsen burner.",
      "If you were a laser, you'd be set on stunning."
    ]
  },
  {
    "category_name": "Sweet",
    "category_id": "sweet",
    "icon": "💕",
    "messages": [
      "I hope you know CPR, because you just took my breath away!",
      "Your eyes are like the ocean; I could swim in them all day.",
      "When I look in your eyes, I see a very kind soul.",
      "I never believed in love at first sight, but that was before I saw you.",
      "I didn't know what I wanted in a woman until I saw you.",
      "No wonder the sky is gray, all the color is in your eyes.",
      "You're like a fine wine. The more of you I drink in, the better I feel.",
      "You've got a lot of beautiful curves, but your smile is absolutely my favorite.",
      "I would never play hide and seek with you because someone like you is impossible to find.",
      "I always thought happiness started with an h, but it turns out mine starts with u.",
      "They say Disney World is the happiest place on Earth, but clearly they've never stood next to you.",
      "I must be in a museum because you're a piece of art.",
      "The sparkle in your eyes is so bright, the sun must be jealous.",
      "If beauty were time, you'd be eternity.",
      "I swear someone stole the stars from the sky and put them in your eyes.",
      "I'm not usually religious, but when I saw you, I knew you were the answer to my prayers.",
      "Wow, when God made you, he was seriously showing off.",
      "I was going to say something really sweet about you, but when I saw you, I became speechless.",
      "I'd say, God bless you, but it looks like he already did.",
      "Did the sun come out, or did you just smile at me?",
      "Well, here I am! What are your other two wishes?",
      "The sparkle in your eye is so bright, the sun and stars must be jealous.",
      "I can't help but smile whenever I think about you.",
      "You brighten up my day every time I see your name pop up on my phone.",
      "Every moment with you is like a beautiful dream I never want to wake from.",
      "Your smile is the best part of my day.",
      "When I see you, I know what happiness truly means.",
      "Just the thought of you gives me butterflies.",
      "I feel like the luckiest person in the world to have you in my life.",
      "You make everything better just by being around.",
      "You're the reason I look forward to tomorrow.",
      "You have a way of making my heart smile.",
      "Every love song makes me think of you.",
      "Having you in my life is like a dream come true.",
      "Now that I’ve seen you, life without you is like a broken pencil…pointless.",
      "Guess what I’m wearing? The smile you gave me.",
      "I think we’ve met before. Actually, never mind—I think it was just in my dreams.",
      "Your smile is proof that the best things in life are free.",
      "You’re my compass. Wherever I go, my thoughts return to you.",
      "You're so sweet, my teeth hurt when I talk to you.",
      "Did you fall out of a sugar bowl? Because you look super sweet.",
      "If you were a vegetable, you'd be a cute-cumber.",
      "If you were a fruit, you’d be a fine-apple.",
      "Are you made of sugar? Because you're sweet enough to give me a toothache.",
      "You're so sweet, you could put Hershey's out of business.",
      "Do you like Disney movies? Because you’re a dream come true.",
      "You make me feel like the luckiest person alive.",
      "My sweet tooth has been itching since the minute I saw your profile.",
      "This might sound cheesy, but I think you’re really grate.",
      "If I had a nickel for every time I saw someone as beautiful as you, I’d still only have $.05.",
      "Is your name chamomile? Because you look like a hot tea.",
      "Wouldn’t we look cute topping a wedding cake together?",
      "Do you like bagels? Because you’re one of my bae-goals.",
      "My love for you is like Pi... never-ending.",
      "Even if there was no gravity on Earth, I'd still fall for you.",
      "The universe is constantly expanding, but I keep getting pulled towards you.",
      "You must be made of uranium and iodine, because all I can see is U and I together.",
      "You must be a cell, because my DNA is all about you.",
      "You are just like a snowflake: beautiful, unique and with one touch, you'll be wet.",
      "You're like a hidden lyric in my favorite song—something I didn’t know I needed until I found it.",
      "I’ve stopped making wishes—you’re better than anything I hoped for.",
      "I don’t need GPS—my heart knows exactly where you're going.",
      "I wasn’t planning to fall for someone today, but here you are.",
      "You're like an unsaved Word doc—I’d panic if I ever lost you.",
      "You must have a magnet in your soul—because here I am, drawn.",
      "Falling for you feels like a homecoming I never expected.",
      "If hugs could talk, mine would always whisper your name.",
      "I wasn’t looking for a soulmate until you answered questions I never asked.",
      "You’re my favorite thought I rewind a thousand times before I sleep.",
      "You make me want to write love songs in languages I don’t even speak.",
      "I didn’t believe in destiny until your name started echoing in mine.",
      "I want to be the reason your pillow smells like safety.",
      "You’re the type of person mirrors are lucky to reflect.",
      "You are what makes my life feel hand-written.",
      "You're the ‘good’ in all my good mornings.",
      "You give soft places for my mind to rest.",
      "Every time you laugh, my world realigns.",
      "You’re my favorite ‘unexpected’ ever.",
      "You speak, and suddenly people start listening to the stars.",
      "I’d rather have one lifetime with you than eternity without.",
      "You have the kind of warmth that makes a house a home.",
      "You’re my favorite decision disguised as coincidence.",
      "If I could build a home out of someone’s soul—it’d be yours.",
      "You're the moment in my day I didn’t know I was waiting for.",
      "If I could pause life, it would be on your laughter.",
      "You’re the kind of person poems fail to describe.",
      "If your voice were a track, I’d have it on loop.",
      "I’d memorize your flaws just to love you right.",
      "You’re the unread message I keep rechecking like a fool.",
      "I want your yesterdays, your todays, and especially your forever.",
      "I didn’t expect you, but you’re the best kind of interruption.",
      "If I had to choose comfort in one form—it would be your smile.",
      "You walk past, and suddenly everyone else fades to grayscale.",
      "You’re the wish my eyelashes made before I knew I needed one.",
      "You're every chapter my past was preparing me for.",
      "If you were a page in my story, I’d never turn it.",
      "I’d cancel my plans just to hear about your day.",
      "You're the gentle chaos I didn’t know I needed.",
      "You bring peace where even music fails."
    ]
  },
  {
    "category_name": "Romantic",
    "category_id": "romantic",
    "icon": "💖",
    "messages": [
      "I'm not currently an organ donor, but I'd be happy to give you my heart.",
      "You must be a h*ll of a thief, because you managed to steal my heart from across the room.",
      "If you let me borrow a kiss, I promise I'll give it right back.",
      "If I could rearrange the alphabet, I'd put U and I together.",
      "I'm not a photographer, but I can picture me and you together.",
      "You are the reason my heart beats faster every time I hear your name.",
      "I never knew what love was until I met you.",
      "You make every day feel like Valentine's Day.",
      "When I'm with you, I feel like I've found my other half.",
      "Your love is the most precious gift I've ever received.",
      "You complete me in every way possible.",
      "I can't imagine my life without you in it.",
      "Every moment spent with you is a moment I treasure.",
      "You are the queen of my heart.",
      "Being with you feels like magic.",
      "Your love is my greatest treasure.",
      "I'm so lucky to have you as my girl.",
      "I fall in love with you more deeply every single day.",
      "You are my one and only.",
      "You're the most beautiful chapter in my life.",
      "Your love is the light that guides me through dark times.",
      "I want to spend forever making you feel loved.",
      "My heart beats for you alone.",
      "You are my greatest adventure.",
      "Loving you is the best decision I've ever made.",
      "Do you have a pencil? Because I want to erase your past and write our future.",
      "I’m lost. Can you give me directions to your heart?",
      "Let’s commit the perfect crime. I’ll steal your heart, you steal mine.",
      "Let me tie your shoes. I don’t want you falling for anyone else.",
      "I bought you a dictionary since you add so much meaning to my life.",
      "I was wondering if you had an extra heart since you just stole mine.",
      "Cupid called. He says you need to return my heart.",
      "If I had a time machine, I’d use it to relive this exact moment.",
      "Will you grab my arm so I can tell my friends I’ve been touched by an angel?",
      "My new favorite numbers are one and four...because you're the one four me.",
      "Let’s flip a coin. Head, I’m yours. Tails, you’re mine.",
      "You’re that one track that’s worth buying the whole album for.",
      "You must be my Mr./Mrs. Right.",
      "If kisses were snowflakes, I’d send you a blizzard.",
      "If I were a cat, I’d spend all nine of my lives with you.",
      "Do you have a Band-Aid? I scraped my knees falling for you.",
      "Are you a cat? Because you’re purr-fect.",
      "See that space between your fingers? That’s for mine.",
      "Can you tame butterflies? The ones in my stomach are out of control.",
      "Do you know what the Little Mermaid and I have in common? We both want to be part of your world.",
      "I wish I'd paid more attention to science in high school, because you and I have chemistry.",
      "Did we go to school together? I could swear we had chemistry.",
      "Are you a carbon sample? Because I want to date you.",
      "Are you a black hole? Because you're irresistibly attractive.",
      "You remind me of a magnet because you sure are attracting me over here.",
      "My heart skipped a beat—and then it saw you and started dancing."
    ]
  },
  {
    "category_name": "Witty",
    "category_id": "witty",
    "icon": "🧠",
    "messages": [
      "I ought to complain to Spotify for you not being named this week's hottest single.",
      "I was wondering if you're an artist because you were so good at drawing me in.",
      "On a scale of 1 to America, how free are you tonight?",
      "If you were a Transformer, you'd be Optimus Fine.",
      "Are you any good at boxing? Because you look like a knockout.",
      "It's a good thing I have my library card, because I am totally checking you out.",
      "Hey, my name's Microsoft. Can I crash at your place tonight?",
      "Did your license get suspended for driving all those guys crazy?",
      "Are you a broom? Because you've swept me off my feet.",
      "Are you from Tennessee? Because you're the only 10 I see.",
      "Are your parents bakers? Because you're a cutie pie.",
      "Did it hurt? When you fell from heaven?",
      "Are you a parking ticket? Cause you've got fine written all over you.",
      "If you were a chicken, you’d be im-peck-able.",
      "Do you have a map? I think I just got lost in your eyes.",
      "Know what's on the menu today? Me 'n u.",
      "Are you a beaver? Because dammm, girl.",
      "If you were a flower, you'd be a daaaaaamn-delion.",
      "Kiss me if I'm wrong, but dinosaurs still exist, right?",
      "I'm studying to be a historian, and I'm especially interested in how to find a date.",
      "Is your name Netflix? Because I could watch you for hours.",
      "What do you call a string of people lifting a mozzarella cheese? A cheesy pickup line.",
      "My mom told me not to talk to strangers online, but I’ll make an exception for you.",
      "Do you play soccer? You look like a keeper.",
      "Have we met? You look exactly like my next partner.",
      "Titanic? That’s my icebreaker. What’s up?",
      "Are your shoelaces tied? I don’t want you falling for anybody else.",
      "Is this the Hogwarts Express? Because you sure make this trip seem magical.",
      "Your name must be Coca-Cola because you’re soda-licious.",
      "Did it hurt when you fell from the vending machine? Cause you’re lookin’ like a snack.",
      "I heard you like bad boys? Well, I’m bad at everything.",
      "I’d flirt with you, but I’d rather seduce you with my awkwardness.",
      "You don’t know how many times I’ve had to swipe left to find you.",
      "I’m writing an article on the finer things in life and was hoping to interview you.",
      "Not even Snape could Severus apart.",
      "Do you fish? Because you have me hooked.",
      "How much does a polar bear weigh? Enough to break the ice!",
      "I bet your birthday is October 10 because you’re a 10/10.",
      "Is your nickname Chapstick? Because you’re da balm!",
      "My friends bet me I couldn’t talk to the prettiest girl in the bar. Want to use their money to buy some drinks?",
      "I would say God bless you, but it looks like he already did.",
      "Will you go out with me or do I have to lie to my journal?",
      "What do you call ice cream at Dairy Queen? Our first date.",
      "Are you a bank loan? Because you've got my interest.",
      "I'm pretty good at algebra...I can replace your X and you wouldn't need to figure out Y.",
      "Is it okay if I follow you home? Because my parents always told me to follow my dreams.",
      "Are you Siri? Because you autocomplete me.",
      "Are you the internet? Because I'm feeling a connection.",
      "Do you like Nintendo? Because Wii would be so good together.",
      "Whenever I meet someone new, I start talking about climate change. That’s usually enough to break the ice.",
      "Your eyes are like IKEA. I could get lost in them for hours.",
      "Do you know how to train butterflies? The ones in my stomach right now are quite untamed.",
      "Is your name Waldo? Because someone like you is hard to find.",
      "You look like a cab driver. Will you take me home?",
      "Are you a keyboard? Because you're just my type.",
      "I'm re-arranging the alphabet and I need one more letter...U.",
      "I had a good pickup line ready to go, but you’re so good-looking I’m literally speechless.",
      "If you were a flower, you’d be a daaaaaamn-delion.",
      "We’re not socks, but I think we’d make a great pair.",
      "Hey, you’re pretty and I’m cute. Together we’d be pretty cute.",
      "Let’s taco ‘bout how amazing you are over tacos and margaritas next week.",
      "You're hotter than a Bunsen burner.",
      "We have such great chemistry, let's do some biology.",
      "If you were a laser, you'd be set on stunning.",
      "I can’t tell if that was an earthquake or if you just rocked my world.",
      "You’re like my Wi-Fi—when you're near, everything just connects better.",
      "You must be a debugger—because you've fixed parts of me I didn’t know were broken.",
      "You must be a software update—because my heart keeps restarting around you.",
      "Are you a function? Because every time you call, my heart executes joy.",
      "Are you running on Python? Because you’re way too smooth for real life.",
      "If flirting was coding, you’d be my favorite function call.",
      "You're like open-source—free, powerful, and beautiful.",
      "Are you an IDE? Because you make everything easier to build.",
      "Are you a semicolon? Because my life was a mess until you showed up.",
      "Are you a browser tab? Because you’ve been open in my mind all day.",
      "Are you a PDF? Because I want to keep you uneditable and safe.",
      "You debug my bad days like it’s your natural instinct.",
      "You must’ve been compiled from perfect source code.",
      "Do you have a map? I got lost in your metadata."
    ]
  },
  {
    "category_name": "Flirty",
    "category_id": "flirty",
    "icon": "😏",
    "messages": [
      "I'd like to take you to the movies, but they don't let you bring in your own snacks.",
      "You know what you would look really beautiful in? My arms.",
      "I think there's something wrong with my phone. Could you try calling it to see if it works?",
      "Do you ever get tired from running through my thoughts all night?",
      "Your hand looks heavy—can I hold it for you?",
      "I'm really glad I just bought life insurance, because when I saw you, my heart stopped.",
      "Would you mind giving me a pinch? You're so cute, I must be dreaming.",
      "Excuse me, do you have the time? I just want to remember the exact minute I got a crush on you.",
      "You know, I had a pickup line ready to go, but you're so hot it just left my mind.",
      "When I text you goodnight later, what phone number should I use?",
      "You know, I believe that honesty is the best policy, so to be perfectly honest, you're the s*xiest man I've ever seen.",
      "There must be something wrong with my eyes—I can't seem to take them off of you.",
      "Trust me, I'm not drunk; I'm just intoxicated by you.",
      "I was just trying to buy a drink here, but you're very distracting.",
      "You see my friend over there? S/he wants to know if you think I'm cute.",
      "You're so fine, you made me forget my pickup line.",
      "You owe me a drink. Because when I saw you, I dropped mine.",
      "Did you just come out of an oven? Because you’re too hot to handle.",
      "They say dating is a numbers game, so can I get yours?",
      "Do you have a sunburn, or are you just always this hot?",
      "Can I have your picture so I can show Santa what I want for Christmas this year?",
      "On a scale of 1 to 10, you're a nine, and I'm the one you need.",
      "When I text you good morning tomorrow, what number should I use?",
      "Your lips look lonely. Would they like to meet mine?",
      "Aside from being s*xy, what do you do for a living?",
      "Do you have a name? Or can I call you mine?",
      "You can delete the app now, I’m here.",
      "Hey, how was heaven when you left it?",
      "Hi, my name is [your name here], but you can call me tonight.",
      "I’m not sure how this works, are we married now?",
      "What number should I send my good morning texts to?",
      "I’m writing a phone book, can I get your number?",
      "Can I borrow your phone? I need to call God and tell him I’ve found his missing angel.",
      "My phone’s broken, it doesn’t have your number in it.",
      "I seem to have lost my phone number. Can I have yours?",
      "My new favorite number is...yours actually. Wanna share?",
      "Do you believe in love at first sight or should I walk by again?",
      "What’s your favorite drink? I’m asking so I know what to buy you on our first date.",
      "I'm going to complain to Spotify that you’re not in this week’s hottest singles.",
      "Hello, I’m a thief, and I’m here to steal your heart.",
      "I was blinded by your beauty. I’m going to need your name and number for insurance purposes.",
      "What emoji should I put next to your name in my phone?",
      "Can we snap a pic so I can show all my friends what I want my next relationship to look like?",
      "Can I take your picture? My mom doesn't believe angels exist.",
      "Hi, I'm Mr./Miss Right. I heard you were looking for me.",
      "Do you know what would look great on you? Me.",
      "Want to grab coffee? I like you a latte.",
      "Do you have any raisins? No? How about a date?",
      "Is your hand lonely? Let me hold it.",
      "I must be a light switch, because every time I see you, you turn me on.",
      "Are we at the airport? Because my heart is taking off every time I see you.",
      "Are you a camera? Every time I look at you, I smile.",
      "Do you like Mexican food? I’d like to wrap you up into a bae-rito.",
      "Are you a charger? Because I'm dying without you.",
      "Are you a meteor? Because you're rocking my world.",
      "If looks could text, you’d already have my number.",
      "You’re not just attractive, you’re a beautiful problem I want to solve slowly.",
      "You give my heart that 'just liked your story' kind of buzz.",
      "You’ve got that look that makes promises I want to believe.",
      "You’re why I stare too long and smile too fast."
    ]
  },
  {
    "category_name": "Spicy",
    "category_id": "spicy",
    "icon": "🌶️",
    "messages": [
      "If being s*xy was a crime, you'd be guilty as charged.",
      "If you were a fan, I'd want you to blow on me.",
      "Are you a birthday cake? Because I want to blow on you.",
      "Can you do telekinesis? Because you've made a part of me move without even touching it.",
      "I'm just like a pore strip. Hard to get off, but extremely satisfied once you do.",
      "Is that a candy cane in your pocket or are you just happy to see me?",
      "Are you a cigarette? Because I want to suck on you until you’re finished.",
      "Are you a termite? Cause you're about to get a mouthful of wood.",
      "Want to save some water later?",
      "Twinkle twinkle little star, let’s have s*x in my car.",
      "You look like a hard worker. I have an opening you can fill.",
      "I'll give you a nickel if you tickle my pickle.",
      "I hope you're a plumber, 'cause you got my pipe leaking.",
      "Let's play Barbie. I'll be Ken and you can be the box I come in.",
      "Are you petrol? Cause I want to pump you in the back of my car.",
      "Let's play Titanic, you can lay on my wood and I'll be the one to go down.",
      "The word of the day is \"legs.\" Let's go back to my place and spread the word.",
      "They call me Dumbledore cause I’m the headmaster.",
      "You're so hot my zipper's falling for you.",
      "I know a great way to burn off the calories in that drink.",
      "I've been super on top of things lately. Do you want to be one of them?",
      "I lost my virginity- can I have yours?",
      "I'm not into watching sunsets, but I’d love to see you go down.",
      "I'm busy, but I could still add you to my to-do list.",
      "I'm not feeling myself today- can I feel you instead?",
      "Your body is 70% water and I'm thirsty.",
      "Your outfit would look so good on my bedroom floor.",
      "I love my bed, but I'd rather be in yours.",
      "Are you an Oreo? Cause I want to double-stuff you.",
      "Call me Oscar Mayer cause I'm gonna fill those buns.",
      "I'm a starving artist and I want to eat you.",
      "Do you wanna be the puff to my cream?",
      "My lips are like Skittles- wanna taste the rainbow?",
      "I hope you remember my name since you'll be screaming it later tonight.",
      "You wanna go skinny dipping... in my waterbed?",
      "You seem like a sweet person- mind if I lick you out?",
      "Are you a bowling ball? Cause I want to put 3 fingers in you.",
      "Are you a notebook? Cause I want to put my ink in you.",
      "You must be ice cream- 'cause I want to lick you up.",
      "My d*ck just died. Can I bury it in you?",
      "I’d hide every chair in the world, so the only place you could sit is my face.",
      "You smell like trash- can I take you out?",
      "You’ve got a friend with benefits in me.",
      "I’m no horse, but I’ll still let you ride me.",
      "I’ll show you my tan lines if you show me yours.",
      "Do you have insurance? We’re smashing tonight.",
      "FYI: I’m psychic, and we’re hooking up tonight.",
      "I was feeling a little off today, but you just turned me on.",
      "I’m no carpenter, but even I can tell that’s some quality hardwood you’re packing.",
      "You need to stop, drop, and roll right now- you're on fire!",
      "I'm getting tan just standing here- because you're scorching hot.",
      "Excuse me, but I think you dropped something- my pants.",
      "I don’t think I want your babies, but I wouldn’t mind refining my baby-making technique with you.",
      "I’ve got all these forks and knives. All I need is a little spoon.",
      "Are you a pirate? Because I could've sworn you were looking at my booty.",
      "I’d give up my morning cereal to spoon you instead.",
      "Are you made of copper and tellurium? Because you’re Cu-Te.",
      "I'm becoming an astronaut so I can explore Uranus.",
      "There will only be 7 planets in the solar system after I destroy Uranus.",
      "All these planets, but I wanna discover Uranus.",
      "Are you salt? Because you're sodium fine.",
      "I think you might be lacking some vitamin me.",
      "Are you a scientist? Because I've got my ion you.",
      "Are you my appendix? Because I have a funny feeling in my stomach that makes me want to take you out.",
      "My doctor told me I have a Vitamin D deficiency- wanna go back to my place and fix that for me?",
      "My doctor told me I'm missing some vitamin u. Can you help me?",
      "Are you an archaeologist? Because I’ve got a bone for you to examine.",
      "Are you Medusa? Cause I turned rock-hard as soon as I looked at you.",
      "Are you a drill sergeant? Because you have my privates standing at attention.",
      "You’re turning my floppy disc into a hard drive.",
      "Are you Abraham Lincon? Cause there’s an uprising down south.",
      "I’m like Lara Croft- I want to explore every inch of your temple.",
      "You must be an archeologist to dig such a hole in my heart.",
      "If I said I was thinking about kissing you, would you stop me or join me?",
      "If flirting was a crime, I’d be serving a life sentence with you.",
      "If danger had a face, it’d be wearing your lipstick.",
      "Your walk? Illegal in half the countries. My heart’s filing a complaint.",
      "That look? It’s writing bedtime stories I shouldn’t repeat in public.",
      "Every glance from you feels like undressing—without touching a thing.",
      "If we shared a bed, morning wouldn't be the end—it'd be the encore.",
      "You make me want to misbehave, just to see how you’d react.",
      "If you were a sin, I’d break every rule just to repeat you.",
      "If I had a dollar for every dirty thought about you—I’d owe you change.",
      "Are you made of satin and sin? Because I want to wrap myself in both.",
      "You wear those jeans like they owe you money—and I'm here to collect.",
      "Look at me like that again, and I’ll write a story about us tonight.",
      "I want your hands somewhere they’re not supposed to be—like mine.",
      "You're the reason my imagination now requires parental guidance.",
      "That body could cause a power outage—and I want to be the spark.",
      "I’m not interested in forever, just a night that feels like it.",
      "You aren’t just in my thoughts—you live rent-free in my future.",
      "What you're wearing is unfair—especially on my concentration.",
      "I like you best with your voice cracking and your hair messy.",
      "Let’s make the neighbors jealous—and confused.",
      "If I said I wanted to wake up next to you, would that be too soon or too late?",
      "Warning: Standing too close to you might trigger dangerous fantasies.",
      "One more look from you, and I’ll need to step outside and cool off.",
      "I’ve got one hand on logic, the other wants to trace your curves.",
      "I don’t just want you—I want the echo of your name in my sheets.",
      "I’d explore your body like it holds the last map to paradise.",
      "Every time you bite your lip, I lose a bit of self-control.",
      "Keep looking at me like that and I’ll forget how to behave.",
      "You bend my thoughts in positions I can't share in public.",
      "I wasn’t trying to seduce you—until you made it worth it.",
      "Your eyes have a gravity problem—they keep pulling me in.",
      "You look like a conversation I’d rather have in whispers.",
      "Tell me to stop, or I’ll keep imagining how good we’d be.",
      "If I followed my instincts, I’d already be closer to you.",
      "Your thighs look like the perfect place to lose my mind.",
      "You carry desire like a scent—undeniable, unforgettable.",
      "Let's give your neighbors something to complain about.",
      "You’re the type of beautiful I want to unpack slowly.",
      "I wasn’t planning on sinning today, but here you are.",
      "Our shadows would blush if they knew my thoughts.",
      "Don’t tempt me—unless you plan to follow through.",
      "I don’t fantasize. I plan—with you in mind.",
      "You don’t just have looks—you have gravity.",
      "I’ll behave—unless you prefer otherwise.",
      "There’s something in your eyes that makes me want to confess my worst intentions.",
      "Let me learn your skin like it’s the only language I’ll ever speak again.",
      "You're not on my mind—you’re on my list of things to ruin softly.",
      "Do I want your number? No—I want your time, your mind, your skin.",
      "You look like trouble—but the kind I wouldn’t mind getting into.",
      "I don’t want your heart—I want your breath trembling under mine.",
      "Say my name like it’s a secret you don’t want to keep anymore.",
      "If this tension were any thicker, we’d need to cut through it with a kiss.",
      "If you were any hotter, my thoughts would start melting.",
      "You're so hot, I'm sweating and we haven't even touched yet.",
      "You’re turning my innocent thoughts into rated-R scenarios.",
      "Let’s skip the flirting and pretend we’re already tangled.",
      "Forget Netflix. Let’s make our own scenes.",
      "I don’t want to rush—just ruin you gently.",
      "You walk like temptation just found legs.",
      "I’m not trying to seduce you. I’m trying to ruin you for anyone else.",
      "I’m not a gambler, but I’d bet my attention on you every time.",
      "Are we talking or slowly undressing each other with our eyes?",
      "I don’t want small talk—I want slow touches and honest looks.",
      "You make me want to skip dinner and go straight to dessert."
    ]
  },
  {
    "category_name": "Seductive",
    "category_id": "seductive",
    "icon": "🔥",
    "messages": [
      "I don't care about going down in history. I want to go down on you.",
      "I have an aching headache. I've heard that the best cure for headaches is wild, passionate s*x.",
      "Your clothes are making me really uncomfortable- could you please take them off?",
      "Your hair would look really good… In my lap.",
      "I'm very adventurous- can I explore your cave?",
      "I’d definitely have s*x with me if I were you.",
      "I'm not staring at your b**bs I'm looking at your heart.",
      "I'm gonna call you a farmer ‘cause you have big, round melons.",
      "Am I supposed to sign for your package?",
      "If I were a judge, I’d sentence you to my bed.",
      "Are your legs Oreos? Cause I wanna split them and lick the middle.",
      "Your a*s looks lonely without my hands on it.",
      "My dick’s been feeling a little dead lately- wanna give it mouth-to-mouth?",
      "I'm wasted- but this condom in my pocket doesn't have to be.",
      "Are you butt-dialing me? Because I swear that a*s is calling me.",
      "Looks like the conversation’s dying- why don’t you sit on my lap, and we’ll talk about the first thing that pops up.",
      "Tell your b**bs to stop staring into my eyes.",
      "Are you a cowgirl? Because I can see you riding me.",
      "Do you mix concrete for a living? Because you’re making me hard.",
      "Call me cake because I'll go straight to your a*s.",
      "Call me leaves because you should be blowing me.",
      "As long as I have a face, you’ll have a place to sit.",
      "You should sell hotdogs; you already know how to make a sausage stand.",
      "I hope you like dragons because I'll be dragon my balls across your face tonight.",
      "I just sh*t my pants- can I get in yours?",
      "Your smile is almost as big, warm, and lovely as my p*nis.",
      "The FBI wants to steal my p*nis- can I hide it inside you?",
      "Wanna see if you have a gag reflex?",
      "Your a*s looks tight- want me to loosen it up?",
      "Why pay for a bra when I'd gladly hold your b**bs up all day?",
      "I’m no lumberjack, but I can still give you some wood.",
      "I want to explore every inch of you.",
      "You set my soul on fire.",
      "The thought of you keeps me up all night.",
      "I crave the taste of your lips.",
      "Being close to you is intoxicating.",
      "I can’t stop thinking about the way you move.",
      "I want to feel your breath on my skin.",
      "Your touch sends shivers down my spine.",
      "I can’t get enough of the way you look at me.",
      "Your scent is my favorite drug.",
      "I want to lose myself in our passion.",
      "I need your touch to warm me up.",
      "Your voice is my favorite sound.",
      "I dream of feeling your warmth next to me.",
      "Being away from you is torture.",
      "Your beauty takes my breath away.",
      "You are my deepest desire."
    ]
  },
  {
    "category_name": "Dirty",
    "category_id": "dirty",
    "icon": "😈",
    "messages": [
      "If you were a door I’d bang you.",
      "You love sleeping? Me too! We should do it together sometime.",
      "I think I could fall madly in bed with you.",
      "When I was younger all I wanted was an A, now all I want is an F.",
      "I'm not too good at Algebra but doesn't U + I = 69.",
      "I don't work at Subway, but I can still give you a footlong.",
      "Are you a cigarette? Cause I wanna put your butt in my mouth.",
      "Wanna be Minecraft without the craft?",
      "I sleep in a coffin because my bedroom’s a boneyard.",
      "You have the strongest arms I’ve ever seen. Here, wrap them around me.",
      "If you were a wood chuck and could chuck wood, how much wood would you chuck me?",
      "What is the difference between me and a wood chuck? I can give you more wood.",
      "What’s the difference between me and a mosquito? A mosquito will stop sucking when you slap it.",
      "Can we play army? I’ll lay down and you can blow the h*ll out of me.",
      "What’s the difference between me and the Navy? I have more ‘seaman’ waiting to come inside of you.",
      "What’s the difference between earmuffs and your thighs? Your thighs will block out more noise later.",
      "Did you get those pants for 50% off? They’re 100% off at my place.",
      "If I flip a coin, what are my chances of getting a head?",
      "Let’s make a deal: I’ll cook you dinner if you make me breakfast.",
      "Are you an exam? Because I’m going to finish early and disappoint my family with the result.",
      "Are you good with kids? Cause I’m about to turn your mouth into a daycare.",
      "I think you’re a bit too short- want me to add some inches in you?",
      "I’m hungry for some chicken right now. Don’t have any? I’m not picky- I’ll settle for a c*ck.",
      "Wanna go half and half on a bastard?",
      "Do you have pet insurance? Because I’m going to pound your p*ssy.",
      "Would you like to try an Australian kiss? It is just like a French kiss, but down under.",
      "Your place or mine? Tell you what? I’ll flip a coin. Head at my place, tail at yours.",
      "What’s common between roses and your panties? I want to smell them both.",
      "I heard you were looking for a stud. Well, I’ve got the STD- all I need is U.",
      "Want a job? It blows.",
      "Do you know the best slip-and-slide for kids? My throat.",
      "Are you constipated? Cause I wanna f*ck the sh*t out of you.",
      "Sorry to bother you, but do you have room for an extra tongue in your mouth?",
      "Roses are red, violets are blue. I can’t rhyme; get in my bed.",
      "Are you my new boss? Because you just gave me a raise.",
      "Nice pants! Can I talk you out of them?",
      "I have 70 ways to make you feel better: 1 hug and 69.",
      "I’m jealous of your heart ‘cause it’s pumping inside of you but I’m not.",
      "Are you a shark? Because I’ve got some swimmers for you to swallow.",
      "I used to get A’s in school, but now I just want to F.",
      "Are you a campfire? Because you’re hot and I want s’more.",
      "I wanna use your thighs as ear muffs.",
      "Let me insert my plug into your socket so we can generate some electricity.",
      "Fancy a 68, you go down on me and I’ll owe you one.",
      "They say the tongue is the strongest muscle- wanna wrestle?",
      "Your b**bs look heavy- can I hold them for you?",
      "Nice pants- can I test the zipper?",
      "Do you like bacon? Wanna strip?",
      "You’re like a Rubik’s cube- the more I play with you, the harder you get.",
      "Are you a rainstorm? Cause you’re making me dripping wet.",
      "Are you soda? Cause I’d like to mount and do you.",
      "I’m vegan, but I’d taste your meat.",
      "What’s a nice guy like you doing in a dirty mind like mine?",
      "Let only latex stand between us.",
      "My nickname is Dishes- because I want you to get me wet and then do me.",
      "Would you kiss me in the rain? I want to be twice as wet.",
      "Let’s play “Carpenter.” First, we’ll get hammered. Then I’ll nail you.",
      "If I buy you dinner, will you be my dessert?",
      "Are you a farmer? Because you look like you know how to raise a c*ck.",
      "Let’s do some math. Add a bed, subtract our clothes, divide your legs, and multiply.",
      "Let’s play “house.” You’ll be the door, and I’ll bang you all I want.",
      "There are 206 bones in the human body, but I have 207 when you come near me.",
      "Are you flappy bird? Cause I could tap you all night.",
      "Are you my keyboard? Cause I wanna press all your right buttons.",
      "I’m no vampire but I know how to suck.",
      "My ideal body weight is yours on mine.",
      "I have a dirty fantasy and you’re the main character in it.",
      "Call me a burglar ‘cause I’m gonna smash your back door in.",
      "Are you a washing machine? Cause I wanna fill you with my load.",
      "Your b**bs are like mount rushmore- I wish my face was among them.",
      "Roses are red, violets are fine. I’ll be the 6, you be the 9.",
      "Are you an elevator? Cause I want to go up and down on you.",
      "I want to put you on like sunglasses- a leg over each ear.",
      "The only reason I’d kick you out of bed would be to f*ck you on the floor.",
      "Are you a haunted house? Because I’m going to scream when I’m in you.",
      "Have you been sitting on sugar? ‘Cause your ass looks sweet.",
      "Do you want to come over and watch p*rn on my flatscreen mirror?",
      "Call me a beaver because I want your wood.",
      "Are you a baker? Cause I want a creampie.",
      "Are you a trampoline? Because I want to bounce on you.",
      "Can’t give you my virginity anymore, but I can give you the box it came in.",
      "Are you a lollipop? Cause I want to lick you all over.",
      "Are you a Slytherin? Cause I really want you to slither into my chamber of secrets.",
      "I’m no waitress, but I’ll take your tip.",
      "Is your name winter? Cause you’ll be coming soon.",
      "I used to get A’s in school, but I wouldn't mind getting a D now.",
      "Are you a ghost train? Cause I’ll scream when I ride you.",
      "This might seem corny but you’re making me horny.",
      "Do you have a mirror in your pocket? Cause I can see myself in your pants.",
      "I’m like an archaeologist- can’t wait to date you.",
      "Are you a library book? Cause I’m checking you out.",
      "I’m no dentist, but I can give you a filling.",
      "Are you a scientist? Cause I want to do you on a table periodically.",
      "Are you a lightbulb? Cause I’m tryna screw.",
      "Scientists are so fake- they say the sun is the hottest thing but it’s obviously you.",
      "Smiling is the second best thing you can do with your lips.",
      "All the seats are taken- Can I sit on your face?",
      "Your face is so pretty I wanna frame it between my legs.",
      "How do you want your eggs? Poached, scrambled, or fertilized?",
      "My love for you is like diarrhea- I can’t hold it in.",
      "If I were a fly, I’d be all over you- cause you’re the shit.",
      "Lie down on that couch and pretend your legs hate each other.",
      "If I said you had a beautiful body, would you hold it against me?",
      "Are you Mr. Meeseeks? Because I want you to complete one simple task with you and disappear."
    ]
  },
  {
    "category_name": "Compliments",
    "category_id": "compliments",
    "icon": "✨",
    "messages": [
      "In my opinion, there are three kinds of beautiful: Cute, pretty, and s*xy. Somehow, you manage to be all three.",
      "One night, I looked up at the stars and thought, 'Wow, how beautiful.' But now that I'm looking at you, nothing else can compare.",
      "You light up every room you walk into.",
      "Your smile could stop wars and heal hearts.",
      "You have the kindest heart I've ever known.",
      "Your beauty is simply mesmerizing.",
      "I'm in awe of your intellect and grace.",
      "Your laugh is my favorite sound.",
      "Seeing you happy makes my day.",
      "You're the most incredible person I've ever met.",
      "Your eyes hold a world of wonders.",
      "You make everything effortlessly beautiful.",
      "Your strength inspires me every day.",
      "You are a true work of art.",
      "Being around you feels like a breath of fresh air.",
      "Your voice is like a soothing melody.",
      "You make being wonderful look easy.",
      "I admire your passion and determination.",
      "Your presence makes everything better.",
      "Your beauty is only surpassed by your heart.",
      "I'm constantly in awe of your talents.",
      "Getting to know you is the best adventure.",
      "If looks could kill, you’d be a weapon of mass destruction.",
      "What’s it like to be the most gorgeous person in the room?",
      "I’m surprised they don’t ask you to leave—you make everyone else look bad.",
      "Are you a model? No? When did you quit.",
      "You’re not just attractive, you’re a beautiful problem I want to solve slowly.",
      "There’s something royalty-level about how you carry yourself.",
      "You don’t just walk—you persuade air to move for you.",
      "You’re dressed like you know the effect you have—and I’m affected.",
      "You must be solar-powered, because your smile is literally energy.",
      "You must be made of stardust—because you’ve rearranged my galaxy.",
      "You're proof that eye contact should come with a warning.",
      "You make me forget my pickup lines—and that takes talent.",
      "You’re not trying to impress—and that’s what impresses me.",
      "You glow like someone who knows their worth—and then some.",
      "Some people touch you with words. You do it with a glance.",
      "Your silence is more meaningful than most people’s poetry.",
      "You’re the type of person mirrors are lucky to reflect.",
      "Your energy? Unmatchable. Your presence? Unforgettable.",
      "You’re the kind of beauty that pauses conversations."
    ]
  }
]