[
  {
    "category_name": "Sweet",
    "category_id": "sweet",
    "icon": "💕",
    "messages": [
      "I hope you know CPR, because you just took my breath away!",
      "So, aside from taking my breath away, what do you do for a living?",
      "Your eyes are like the ocean; I could swim in them all day.",
      "When I look in your eyes, I see a very kind soul.",
      "I never believed in love at first sight, but that was before I saw you.",
      "I didn't know what I wanted in a woman until I saw you.",
      "No wonder the sky is gray, all the color is in your eyes.",
      "You're like a fine wine. The more of you I drink in, the better I feel.",
      "You've got a lot of beautiful curves, but your smile is absolutely my favorite.",
      "I would never play hide and seek with you because someone like you is impossible to find.",
      "I always thought happiness started with an h, but it turns out mine starts with u.",
      "You know, I always thought that Disneyland was the happiest place on Earth, but that was before I got a chance to stand here next to you.",
      "Want to go outside and get some fresh air with me? You just took my breath away.",
      "I must be in a museum because you're a piece of art.",
      "I just had to tell you, your beauty made me truly appreciate being able to see.",
      "The sparkle in your eyes is so bright, the sun must be jealous.",
      "If I had a nickel for every time I saw someone as beautiful as you, I'd still only have five cents.",
      "If beauty were time, you'd be eternity.",
      "I think the only way you could possibly be more beautiful is if I got to know you.",
      "I don't know which is prettier today—the weather, or your eyes.",
      "I swear someone stole the stars from the sky and put them in your eyes.",
      "I'm not usually religious, but when I saw you, I knew you were the answer to my prayers.",
      "Wow, when God made you, he was seriously showing off.",
      "I was going to say something really sweet about you, but when I saw you, I became speechless.",
      "I'd say, God bless you, but it looks like he already did.",
      "I was going to call you beautiful, but then I realized I don't have your number yet.",
      "Did the sun come out, or did you just smile at me?",
      "Well, here I am! What are your other two wishes?",
      "I can see that you're gorgeous, but what else should I know about you?",
      "Anyone who says Disneyland is the happiest place on earth has clearly never stood next to you.",
      "I don't know your name, but I'm sure it's just as beautiful as you are.",
      "The sparkle in your eye is so bright, the sun and stars must be jealous.",
      "I can't help but smile whenever I think about you.",
      "You brighten up my day every time I see your name pop up on my phone.",
      "Every moment with you is like a beautiful dream I never want to wake from.",
      "You must be a magician because whenever you're around, everything else disappears.",
      "I find myself falling for you more and more every day.",
      "Your smile is the best part of my day.",
      "When I see you, I know what happiness truly means.",
      "Just the thought of you gives me butterflies.",
      "I feel like the luckiest person in the world to have you in my life.",
      "Your happiness is the most beautiful thing in the world to me.",
      "You make everything better just by being around.",
      "You're the reason I look forward to tomorrow.",
      "You have a way of making my heart smile.",
      "Every love song makes me think of you.",
      "Having you in my life is like a dream come true."
    ]
  },
  {
    "category_name": "Romantic",
    "category_id": "romantic",
    "icon": "💖",
    "messages": [
      "I never believed in love at first sight, but that was before I saw you.",
      "I didn't know what I wanted in a woman until I saw you.",
      "You're like a fine wine. The more of you I drink in, the better I feel.",
      "I must be in a museum because you're a piece of art.",
      "I'm not currently an organ donor, but I'd be happy to give you my heart.",
      "You must be a hell of a thief, because you managed to steal my heart from across the room.",
      "If you let me borrow a kiss, I promise I'll give it right back.",
      "We're not socks, but I think we'd make a great pair.",
      "If I could rearrange the alphabet, I'd put U and I together.",
      "I'm not a photographer, but I can definitely picture us together.",
      "If you were a song, you'd be the best track on the album.",
      "You are the reason my heart beats faster every time I hear your name.",
      "I never knew what love was until I met you.",
      "You make every day feel like Valentine's Day.",
      "When I'm with you, I feel like I've found my other half.",
      "Your love is the most precious gift I've ever received.",
      "You complete me in every way possible.",
      "I can't imagine my life without you in it.",
      "Every moment spent with you is a moment I treasure.",
      "You are the queen of my heart.",
      "Being with you feels like magic.",
      "Your love is my greatest treasure.",
      "I'm so lucky to have you as my girl.",
      "I fall in love with you more deeply every single day.",
      "You are my one and only.",
      "You're the most beautiful chapter in my life.",
      "Your love is the light that guides me through dark times.",
      "I want to spend forever making you feel loved.",
      "My heart beats for you alone.",
      "You are my greatest adventure.",
      "Loving you is the best decision I've ever made."
    ]
  },
  {
    "category_name": "Witty",
    "category_id": "witty",
    "icon": "🧠",
    "messages": [
      "I ought to complain to Spotify for you not being named this weeks hottest single.",
      "If you were a vegetable, you'd be a cute-cumber.",
      "I was wondering if you're an artist because you were so good at drawing me in.",
      "Are you a magician? It's the strangest thing, but every time I look at you, everyone else disappears.",
      "On a scale of 1 to America, how free are you tonight?",
      "If you were a taser, you'd be set to stun.",
      "If you were a Transformer, you'd be Optimus Fine.",
      "Is your name Google? Because you have everything I'm searching for.",
      "Do you know what my shirt is made of? Boyfriend material.",
      "If you were a fruit, you'd be a fine-apple.",
      "Are you any good at boxing? Because you look like a knockout.",
      "Did we go to school together? I could swear we had chemistry.",
      "They say nothing lasts forever, so will you be my nothing?",
      "It's a good thing I have my library card, because I am totally checking you out.",
      "Hey, my name's Microsoft. Can I crash at your place tonight?",
      "Did your license get suspended for driving all those guys crazy?",
      "Are you a broom? Because you've swept me off my feet.",
      "Are you from Tennessee? Because you're the only 10 I see.",
      "Are your parents bakers? Because you're a cutie pie.",
      "If you and I were socks, we'd make a great pair.",
      "Did it hurt when you fell from heaven?",
      "Are you a parking ticket? You've got fine written all over you.",
      "If you were a chicken, you'd be im-peck-able",
      "Are you a loan? Because you've got my interest.",
      "Are you French? Because Eiffel for you.",
      "If you were a triangle, you'd be acute one.",
      "If I were a cat, I'd spend all nine of my lives with you.",
      "Do you have a map? I just got lost in your eyes.",
      "Are you a time traveler? Because I see you in my future.",
      "Your hand looks lonely. Can I hold it for you?",
      "I seem to have lost my phone number. Can I have yours?",
      "I hope you know CPR, because you are taking my breath away.",
      "I believe in following my dreams. Can I have your Instagram?",
      "Is your name Google? Because you're everything I've been searching for.",
      "Know what's on the menu today? Me 'n u.",
      "I'm new in town, can I have directions to your house?",
      "Are you an electrician? Because you're lighting up my day.",
      "I'm not an organ donor, but I'm ready to give you my heart.",
      "I think I saw you on Spotify, as the hottest single of the year.",
      "If you were words on a page, you'd be fine print."
    ]
  },
  {
    "category_name": "Flirty",
    "category_id": "flirty",
    "icon": "😏",
    "messages": [
      "I'd like to take you to the movies, but they don't let you bring in your own snacks.",
      "You know what you would look really beautiful in? My arms.",
      "Do you ever get tired from running through my thoughts all night?",
      "I'm really glad I just bought life insurance, because when I saw you, my heart stopped.",
      "I'm not a photographer, but I can definitely picture us together.",
      "Would you mind giving me a pinch? You're so cute, I must be dreaming.",
      "You know, I had a pickup line ready to go, but you're so hot it just left my mind.",
      "You know, I believe that honesty is the best policy, so to be perfectly honest, you're the sexiest man I've ever seen.",
      "There must be something wrong with my eyes—I can't seem to take them off of you.",
      "Trust me, I'm not drunk; I'm just intoxicated by you.",
      "I was just trying to buy a drink here, but you're very distracting.",
      "You're so fine, you made me forget my pickup line.",
      "You owe me a drink. Because when I saw you, I dropped mine.",
      "You must be tired from running through my mind all day?",
      "Did you just come out of an oven? Because you're too hot to handle.",
      "They say dating is a numbers game, so can I get yours?",
      "I'm not drunk, I'm just intoxicated by you.",
      "Do you have a sunburn, or are you just always this hot?",
      "Are you a charger? Because I'm dying without you.",
      "You're so sweet you're giving me a toothache.",
      "On a scale of 1 to 10, you're a 9 and I'm the 1 you need.",
      "I saw you walking by and I just had to come say hello.",
      "When God made you, he was really just showing off."
    ]
  },
  {
    "category_name": "Spicy",
    "category_id": "spicy",
    "icon": "🌶️",
    "messages": [
      "If being sexy was a crime, you'd be guilty as charged.",
      "If you were a fan, I'd want you to blow on me.",
      "Are you a birthday cake? Because I want to blow on you.",
      "Can you do telekinesis? Because you've made a part of me move without even touching it.",
      "I'm just like a pore strip. Hard to get off, but extremely satisfied once you do.",
      "Is that a candy cane in your pocket or are you just happy to see me?",
      "I'm all about signs in life. I just checked my phone battery and it's at 69% so how about it?",
      "Are you a cigarette? Because I want to suck on you until you're finished.",
      "You are just like a snowflake: beautiful, unique and with one touch, you'll be wet.",
      "Are you a termite? Cause you're about to get a mouthful of wood.",
      "If you were a wood chuck and could chuck wood, how much wood would you chuck me?",
      "What is the difference between me and a wood chuck? I can give you more wood.",
      "When I was younger all I wanted was an A, now all I want is an F.",
      "Want to save some water later?",
      "Twinkle twinkle little star, let's have s*x in my car.",
      "Girl, you make me want to dive into that sea… that pus-sea.",
      "You look like a hard worker. I have an opening you can fill.",
      "I'll give you a nickel if you tickle my pickle.",
      "I hope you're a plumber, 'cause you got my pipe leaking.",
      "Let's play Barbie. I'll be Ken and you can be the box I come in.",
      "Are you petrol? Cause I want to pump you in the back of my car.",
      "Let's play Titanic, you can lay on my wood and I'll be the one to go down.",
      "The word of the day is \"legs.\" Let's go back to my place and spread the word.",
      "If you look this good in clothes, I can't imagine how good you'll look without them.",
      "They call me Dumbledore cause I'm the headmaster.",
      "You're so hot my zipper's falling for you.",
      "I know a great way to burn off the calories in that drink.",
      "I've been super on top of things lately. Do you want to be one of them?",
      "I lost my virginity- can I have yours?",
      "I'm not into watching sunsets, but I'd love to see you go down.",
      "Did you just step out of the oven? Because you're hot.",
      "I'm busy, but I could still add you to my to-do list.",
      "I'm not feeling myself today- can I feel you instead?",
      "Your body is 70% water and I'm thirsty.",
      "Your outfit would look so good on my bedroom floor.",
      "I'm not too good at Algebra but doesn't U + I = 69.",
      "I love my bed, but I think I'd love yours too.",
      "Are you an Oreo? Cause I want to double-stuff you.",
      "Call me Oscar Mayer cause I'm gonna fill those buns.",
      "I'm a starving artist and I want to eat you.",
      "I sleep in a coffin because my bedroom's a boneyard.",
      "Do you wanna be the puff to my cream?",
      "My lips are like Skittles- wanna taste the rainbow?",
      "I hope you remember my name since you'll be screaming it later tonight.",
      "You wanna go skinny dipping... in my waterbed?",
      "You seem like a sweet person- mind if I lick you out?",
      "Are you a bowling ball? Cause I want to put 3 fingers in you.",
      "Are you a notebook? Cause I want to put my ink in you.",
      "You must be ice cream- 'cause I want to lick you up.",
      "My dick just died. Can I bury it in you?",
      "I'd hide every chair in the world, so the only place you could sit is my face.",
      "You smell like trash- can I take you out?",
      "You've got a friend with benefits in me.",
      "I'm no horse, but I'll still let you ride me.",
      "I'll show you my tan lines if you show me yours.",
      "Do you have insurance? We're smashing tonight.",
      "FYI: I'm psychic, and we're hooking up tonight.",
      "Are you a DNA strand? Because I can see you unzipping my genes later.",
      "I was feeling a bit off today, but you just turned me on.",
      "I'm no carpenter, but even I can tell that's some quality hardwood you're packing.",
      "You need to stop, drop, and roll right now- you're on fire!",
      "I'm getting tan just standing here- because you're scorching hot.",
      "Excuse me, but I think you dropped something- my pants.",
      "Do you have a spare kiss? I've been saving mine for you.",
      "I don't think I want your babies, but I wouldn't mind refining my baby-making technique with you.",
      "Are you a computer genius? Cause you're turning my software into hardware.",
      "Are you AT&T? Cause you're raising my bar.",
      "I'm a food photographer and you're one hot dish.",
      "Are you a touch screen? Cause I could tap you all day."
    ]
  },
  {
    "category_name": "Seductive",
    "category_id": "seductive",
    "icon": "🔥",
    "messages": [
      "I love my bed, but I'd rather be in yours.",
      "If you were a door I'd bang you.",
      "You love sleeping? Me too! We should do it together sometime.",
      "I think I could fall madly in bed with you.",
      "I don't care about going down in history. I want to go down on you.",
      "I'm becoming an astronaut so I can explore Uranus.",
      "I have an aching headache. I've heard that the best cure for headaches is wild, passionate sex.",
      "Your clothes are making me really uncomfortable- could you please take them off?",
      "Your hair would look really good… In my lap.",
      "I'm very adventurous- can I explore your cave?",
      "I'd definitely have sex with me if I were you.",
      "I'm not staring at your boobs I'm looking at your heart.",
      "I'm gonna call you a farmer 'cause you have big, round melons.",
      "Am I supposed to sign for your package?",
      "If I were a judge, I'd sentence you to my bed.",
      "Are your legs Oreos? Cause I wanna split them and lick the middle.",
      "Your ass looks lonely without my hands on it.",
      "My dick's been feeling a little dead lately- wanna give it mouth-to-mouth?",
      "I'm wasted- but this condom in my pocket doesn't have to be.",
      "You're like my pinky toe- you support me and I'm probably going to bang you on the coffee table",
      "Are you butt-dialing me? Because I swear that ass is calling me.",
      "Looks like the conversation's dying- why don't you sit on my lap, and we'll talk about the first thing that pops up.",
      "I'm like a snowflake: small, and pretty, and you can feel how wet I am with a single touch.",
      "Tell your boobs to stop staring into my eyes.",
      "Are you a cowgirl? Because I can see you riding me.",
      "Do you mix concrete for a living? Because you're making me hard.",
      "Call me cake because I'll go straight to your ass.",
      "Call me leaves because you should be blowing me.",
      "As long as I have a face, you'll have a place to sit.",
      "You should sell hotdogs; you already know how to make a sausage stand.",
      "There will only be 7 planets in the solar system after I destroy Uranus.",
      "All these planets, but I wanna discover Uranus.",
      "I hope you like dragons because I'll be dragon my balls across your face tonight.",
      "I just shit my pants- can I get in yours?",
      "Your smile is almost as big, warm, and lovely as my penis.",
      "The FBI wants to steal my penis- can I hide it inside you?",
      "Wanna see if you have a gag reflex?",
      "Your ass looks tight- want me to loosen it up?",
      "Why pay for a bra when I'd gladly hold your boobs up all day?",
      "I'm no lumberjack, but I can still give you some wood.",
      "I don't work at Subway, but I can still give you a footlong.",
      "Are you a cigarette? Cause I wanna put your butt in my mouth."
    ]
  },
  {
    "category_name": "Compliments",
    "category_id": "compliments",
    "icon": "✨",
    "messages": [
      "In my opinion, there are three kinds of beautiful: Cute, pretty, and sexy. Somehow, you manage to be all three.",
      "One night, I looked up at the stars and thought, 'Wow, how beautiful.' But now that I'm looking at you, nothing else can compare.",
      "You light up every room you walk into.",
      "Your smile could stop wars and heal hearts.",
      "You have the kindest heart I've ever known.",
      "Your beauty is simply mesmerizing.",
      "I'm in awe of your intellect and grace.",
      "Your laugh is my favorite sound.",
      "Seeing you happy makes my day.",
      "You're the most incredible person I've ever met.",
      "Your eyes hold a world of wonders.",
      "You make everything effortlessly beautiful.",
      "Your strength inspires me every day.",
      "You are a true work of art.",
      "Being around you feels like a breath of fresh air.",
      "Your voice is like a soothing melody.",
      "You make being wonderful look easy.",
      "I admire your passion and determination.",
      "Your presence makes everything better.",
      "Your beauty is only surpassed by your heart.",
      "I'm constantly in awe of your talents.",
      "Getting to know you is the best adventure."
    ]
  },
  {
    "category_name": "Cute",
    "category_id": "cute",
    "icon": "🥰",
    "messages": [
      "If you were a vegetable, you'd be a cute-cumber.",
      "If you were a fruit, you'd be a fine-apple.",
      "If you were a taser, you'd be set to stun.",
      "Guess what I'm wearing? The smile you gave me.",
      "If kisses were snowflakes, I'd send you a blizzard.",
      "You must be a parking ticket because you've got 'FINE' written all over you.",
      "Are you made of sugar? Because you're sweet enough to give me a toothache.",
      "I must be a light switch, because every time I see you, you turn me on.",
      "If I were a cat, I'd spend all 9 lives with you.",
      "You're so sweet, you could put Hershey's out of business.",
      "Are we at the airport? Because my heart is taking off every time I see you.",
      "Is your dad a boxer? Because you're a knockout!",
      "You make me feel like the luckiest person alive.",
      "Do you have a sunburn, or are you always this hot?",
      "Our chemistry is hotter than a Bunsen burner.",
      "Are you Wi-Fi? Because I'm feeling a connection.",
      "Are you a camera? Every time I look at you, I smile."
    ]
  },
  {
    "category_name": "Clever",
    "category_id": "clever",
    "icon": "🎯",
    "messages": [
      "Are you French? Because Eiffel for you.",
      "Are you a bank loan? Because you've got my interest.",
      "On a scale of 1 to 10, you're a 9, and I'm the 1 you need.",
      "Do you know what would look great on you? Me.",
      "Are you a campfire? Because you're hot and I want s'more.",
      "If you were a vegetable, you'd be a 'cute-cumber.'",
      "Is your name Google? Because you've got everything I'm searching for.",
      "Are you made of copper and tellurium? Because you're Cu-Te.",
      "If you were a triangle, you'd be acute one.",
      "Are you a parking ticket? Because you've got 'FINE' written all over you.",
      "If you were a fruit, you'd be a fineapple."
    ]
  }
]
