[
  {
    "category_name": "Top Secret",
    "category_id": "top100_premium",
    "icon": "💎",
    "messages": [
      "I was wondering if you're an artist because you were so good at drawing me in.",
      "In my opinion, there are three kinds of beautiful: Cute, pretty, and s*xy. Somehow, you manage to be all three.",
      "My friends bet me I couldn’t talk to the prettiest girl in the bar. Want to use their money to buy some drinks?",
      "I was wondering if you had an extra heart since you just stole mine.",
      "I'm not currently an organ donor, but I'd be happy to give you my heart.",
      "Trust me, I'm not drunk; I'm just intoxicated by you.",
      "You're like a hidden lyric in my favorite song—something I didn't know I needed until I found it.",
      "One night, I looked up at the stars and thought, 'Wow, how beautiful.' But now that I'm looking at you, nothing else can compare.",
      "I was blinded by your beauty. I’m going to need your name and number for insurance purposes.",
      "I have an aching headache. I've heard that the best cure for headaches is wild, passionate s*x.",
      "If I had a time machine, I'd use it to relive this exact moment.",
      "Do you know what the Little Mermaid and I have in common? We both want to be part of your world.",
      "I'm not trying to seduce you. I’m trying to ruin you for anyone else.",
      "My love for you is like diarrhea- I can’t hold it in.",
      "The universe is constantly expanding, but I keep getting pulled towards you.",
      "You’re turning my innocent thoughts into rated-R scenarios.",
      "If flirting was a crime, I’d be serving a life sentence with you.",
      "You're the moment in my day I didn't know I was waiting for.",
      "I’m writing an article on the finer things in life and was hoping to interview you.",
      "If I said I was thinking about kissing you, would you stop me or join me?",
      "You make me want to write love songs in languages I don't even speak.",
      "You don’t know how many times I’ve had to swipe left to find you.",
      "I was gonna say something really sweet about you, but when I saw you I was speechless",
      "I wasn’t looking for a soulmate until you answered questions I never asked.",
      "You have the kind of warmth that makes a house a home.",
      "You remind me of a magnet because you sure are attracting me over here.",
      "You must be a debugger—because you've fixed parts of me I didn’t know were broken.",
      "You make me want to skip dinner and go straight to dessert.",
      "You're like open-source—free, powerful, and beautiful.",
      "You’re that one track that’s worth buying the whole album for.",
      "Falling for you feels like a homecoming I never expected.",
      "If I could build a home out of someone's soul—it'd be yours.",
      "There’s something royalty-level about how you carry yourself.",
      "You're the kind of person poems fail to describe.",
      "You’re turning my floppy disc into a hard drive.",
      "I'm pretty good at algebra...I can replace your X and you wouldn't need to figure out Y.",
      "Let’s make the neighbors jealous—and confused.",
      "You’re my favorite thought I rewind a thousand times before I sleep.",
      "My heart skipped a beat—and then it saw you and started dancing.",
      "Your outfit would look so good on my bedroom floor.",
      "You’re the type of person mirrors are lucky to reflect.",
      "You're the reason my imagination now requires parental guidance.",
      "I’d memorize your flaws just to love you right.",
      "You're the wish my eyelashes made before I knew I needed one.",
      "You carry desire like a scent—undeniable, unforgettable.",
      "You must’ve been compiled from perfect source code.",
      "I was just trying to buy a drink here, but you're very distracting.",
      "Your silence is more meaningful than most people’s poetry.",
      "You’re not trying to impress—and that’s what impresses me.",
      "My doctor told me I have a Vitamin D deficiency- wanna go back to my place and fix that for me?",
      "I'm getting tan just standing here- because you're scorching hot.",
      "If I said I wanted to wake up next to you, would that be too soon or too late?",
      "There’s something in your eyes that makes me want to confess my worst intentions.",
      "You must be a software update—because my heart keeps restarting around you.",
      "You’ve got that look that makes promises I want to believe.",
      "You are what makes my life feel hand-written.",
      "I'd rather have one lifetime with you than eternity without.",
      "I'd like to take you to the movies, but they don't let you bring in your own snacks.",
      "My heart beats for you alone.",
      "I hope you remember my name since you'll be screaming it later tonight.",
      "If I were a cat, I’d spend all nine of my lives with you.",
      "I want to spend forever making you feel loved.",
      "You complete me in every way possible.",
      "You're the most beautiful chapter in my life.",
      "What’s it like to be the most gorgeous person in the room?",
      "Your hands looks heavy, should I hold them for you?",
      "Your beauty is only surpassed by your heart.",
      "You debug my bad days like it’s your natural instinct.",
      "I can’t stop thinking about the way you move.",
      "I'm in awe of your intellect and grace.",
      "You're so sweet, you could put Hershey's out of business.",
      "I wasn’t planning on sinning today, but here you are.",
      "Every glance from you feels like undressing—without touching a thing.",
      "I’m not interested in forever, just a night that feels like it.",
      "You must be solar-powered, because your smile is literally energy.",
      "You're so fine, you made me forget my pickup line.",
      "You’re my favorite decision disguised as coincidence.",
      "I just sh*t my pants- can I get in yours?",
      "You are my greatest adventure.",
      "You make being wonderful look easy.",
      "Being around you feels like a breath of fresh air.",
      "I'm a starving artist and I want to eat you.",
      "I’m no lumberjack, but I can still give you some wood.",
      "You must be made of stardust—because you’ve rearranged my galaxy.",
      "If kisses were snowflakes, I’d send you a blizzard.",
      "You’re the unread message I keep rechecking like a fool.",
      "Your beauty shines so much, that it makes me blind",
      "My sweet tooth has been itching since the minute I saw your profile.",
      "Every time you laugh, my world realigns.",
      "You're that one track that's worth buying the whole album for.",
      "You're proof that eye contact should come with a warning.",
      "You make every day feel like Valentine's Day.",
      "You are a true work of art.",
      "You make me feel like the luckiest person alive.",
      "Your smile could stop wars and heal hearts.",
      "You are my deepest desire.",
      "You must be an archeologist to dig such a hole in my heart.",
      "What you're wearing is unfair—especially on my concentration.",
      "I'm not staring at your b**bs I'm looking at your heart.",
      "I’d cancel my plans just to hear about your day.",
      "This might sound cheesy, but I think you’re really grate.",
      "Your love is the most precious gift I've ever received.",
      "I want to feel your breath on my skin."
    ]
  }
]